# RemoveHost Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..RemoveHost Method
Railing Class See Also
---
Removes the association between the railing and its host.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void RemoveHost()
```

Visual Basic
---
```text
Public Sub RemoveHost
```

Visual C++
---
```text
public:
void RemoveHost()
```

# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace